#      맨 뒷자리수  0    1    2    3    4    5    6    7    8    9  
# 길이
#  1               1    1    1    1    1    1    1    1    1    1    10
#  2               1    2    3    4    5    6    7    8    9    10   55
#  3               1    3    6    10   15   21   28   36   45   55   220
#  4               1    4    10   20   35   56   84   120  165  220  715
#  다음 숫자는  현재 숫자 + (현재길이-1,맨뒷자리수+1)번쨰 숫자 만큼 더한것과 같음

n = int(input())
dp = [1] * 10
for i in range(1, n) :
    for j in range(1, 10) :
        dp[j] += dp[j-1]

print(sum(dp)%10007)

